Revit 2026 API

# PointLocationOnCurveMeasureFrom Property

---

The location on the curve from which the measurement is taken.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public PointOnCurveMeasureFrom MeasureFrom { get; set; }
```
```vb
Public Property MeasureFrom As PointOnCurveMeasureFrom
	Get
	Set
```
```cpp
public:
property PointOnCurveMeasureFrom MeasureFrom {
	PointOnCurveMeasureFrom get ();
	void set (PointOnCurveMeasureFrom value);
}
```
```fsharp
member MeasureFrom : PointOnCurveMeasureFrom with get, set
```

#### Property Value

PointOnCurveMeasureFrom

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

The measure-from is not checked until this class is assigned for a particular reference point on a particular curve. At that time, the measure-from must be valid for the curve.

#### Reference

PointLocationOnCurve Class

Autodesk.Revit.DB Namespace